RedditClone/app/controllers/subs_controller.rb

  def show
    @sub = Sub.find_by(id: params[:id])
    @posts = Post.where("? IN posts.sub_ids", params[:id]) # Not working?
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id # Is this the correct way to assign moderator_id?

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cars"], ["description", "A sub for car lovers!"], ["moderator_id", 1], ["created_at", "2020-05-04 18:07:42.879029"], ["updated_at", "2020-05-04 18:07:42.879029"]]

  def update
    @sub = Sub.find(params[:id]) # At this point we know the sub exists, because the edit form was shown for it.  Technically redundant because #is_moderator was executed.

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "A sub for car fanatics!"], ["updated_at", "2020-05-04 18:31:39.106230"], ["id", 1]]

  def is_moderator?
    @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]