RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ihIzZhblgvq7Oh-1AazgKg"], ["updated_at", "2020-05-04 17:37:14.009873"], ["id", 1]]
---
  def reset_session_token!
    self.update!(session_token: User.generate_session_token)